# GetActiveSunAndShadowSettings Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
SunAndShadowSettings..::..GetActiveSunAndShadowSettings Method
SunAndShadowSettings Class See Also
---
Returns the current SunAndShadowSettings element assigned to the active view for the supplied document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static Element GetActiveSunAndShadowSettings(
	Document aDocument
)
```

Visual Basic
---
```text
Public Shared Function GetActiveSunAndShadowSettings ( _
	aDocument As Document _
) As Element
```

Visual C++
---
```text
public:
static Element^ GetActiveSunAndShadowSettings(
	Document^ aDocument
)
```

# ### Parameters
aDocument
    Type: Autodesk.Revit.DB..::..Document The document.
# ### Return Value
The active SunAndShadowSettings element for the supplied document.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace